[
  {
    "path": "posts/2021-03-23-years-of-wonder/",
    "title": "Newton's Productive Quarentine",
    "description": "We aren't the first ones to work from home.",
    "author": [
      {
        "name": "Ambuj Gupta",
        "url": {}
      }
    ],
    "date": "2021-03-23",
    "categories": [],
    "contents": "\nLoading …\n\n\n\n",
    "preview": {},
    "last_modified": "2021-03-23T09:47:24+05:30",
    "input_file": {}
  },
  {
    "path": "posts/2021-03-21-reading-list-2021/",
    "title": "Reading List 2021",
    "description": "Just a list of books that I plan on finishing by the end of 2021.",
    "author": [
      {
        "name": "Gunjan Payal",
        "url": {}
      }
    ],
    "date": "2021-03-21",
    "categories": [],
    "contents": "\nMathematics\nI’ve spent a long time thinking about whether math is necessary for machine learning. Here’s my answer: absolutely. Here’s the most popular analogy I’ve heard:\n\nIt’s just like a car. To drive it, I don’t have to know how the parts work.\n\nThat’s just stupid. You’re not driving the car in this scenario. You’re the one who’s fucking designing it. To design it, you can get away with not knowing the laws of thermodynamics but not without knowing how the parts fit together. There is an exception to this, though. If you wanna design cars that look like this:\n\n\nYou go, man! You’re ready if that’s what you wanna do. No math required.\n\nIf you actually want to apply machine learning to problems that are genuinely interesting and make a contribution, you have to know the math and the underlying theory. You have to know the limits of machine learning. Contrary to popular belief, machine learning is not ACTUALLY magic. Neural networks are not the solution to everything. It’s problem dependent. This is from the point of view of a guy who wants to go into research. If that’s not your goal, you can get away with knowing a lot less math than this.\n\nUnless you’re comfortable with the math, you’re going to crap your pants while reading research papers. Also, math’s applicable EVERYWHERE. So, you don’t really lose anything.\n\nFor a demonstration of crapping your pants, take a gander at this paper1. If you can understand the math in there, you’re good to go. Here’s a little preview:\n\\[{\\sum_{t=1}^T  \\mathcal S_{P^{\\phi_t}} \\left[\\frac{\\partial L}{\\partial \\phi_{t}}\\right] \\sum_{i=1}^{t} \\big(\\prod_{j = i}^{t-1} \\frac{\\partial \\phi_{j+1}}{\\partial \\phi_j}\\big) \\mathcal S_{P^{\\phi_{i-1}}} \\left[\\frac{\\partial \\phi_i}  {\\partial  C_{i-1}}\\right]\\frac{\\partial  C_{i-1}}{\\partial \\theta}\\,.}\\]\nIntimidating, right?\nI’ll conclude this rant with my math reading list for 2021:\nAnalysis I and II by Terence Tao\nInformation Theory, Inference, and Learning Algorithms by David MacKay\nThe Cauchy Schwarz Master Class by J. Michael Steele\nLinear Algebra and Learning from Data by Gilbert Strang (Just the last section, I know the rest)\nVisual Group Theory (MAA Problem Book Series) by Nathan Carter\n\nWhy group theory? Because it often pops up at unexpected places and I think it’s cool.\nFor the last book, there’s a great accompanying course on YT. I’ll add the link to it in a few days. This year is going to be math heavy and that’s a bit of a problem because people usually only look at your projects and I don’t really have projects yet. I’ve tried making a CV a few times but I come up empty. Hopefully, it won’t be empty by the end of this year.\nI did consider Rudin for Analysis but I liked Tao’s style better.\nMachine Learning\nI do need to apply all that math. Here’s my machine learning reading list. I should warn you that this is fairly intermediate because I read the basic stuff about a year ago.\nThe Elements of Statistical Learning by Hastie et al.\nDeep Learning by Ian Goodfellow\nTensorflow Documentation\nThe Nature of Statistical Learning Theory by Vladimir N. Vapnik\nOther Books that I Think Might be Worth Reading\nSometimes, I just can’t resist the temptation to dive into a completely different field. I have the attention span of a 10 year old. That said, here’s the books that I can’t wait to read:\nProgramming Quantum Computers by Johnston\nNonlinear Dynamics and Chaos by Strogatz\nConcluding Remarks\nMy reading list is fairly small. That’s because we have vastly different courses that are currently going on in our college and I do have assignments to complete and exams to take.\nDistill is a publication format for scientific and technical writing, native to the web.\nLearn more about using Distill at https://rstudio.github.io/distill.\n\nhttps://arxiv.org/abs/2007.10412↩︎\n",
    "preview": "https://media.wired.com/photos/593252a2a31264584499416b/master/w_1600%2Cc_limit/the-homer-inline2.jpg",
    "last_modified": "2021-03-21T21:10:48+05:30",
    "input_file": {}
  },
  {
    "path": "posts/2021-03-20-notes-on-david-mackays-information-theory-inference-and-learning-algorithms/",
    "title": "Notes on David MacKay's Information Theory, Inference and Learning Algorithms",
    "description": "I recently started reading David MacKay's book and this blog post will contain my notes and thoughts on the book. I plan on using Mathematica for basic plotting and calculations.",
    "author": [
      {
        "name": "Gunjan Payal",
        "url": {}
      }
    ],
    "date": "2021-03-20",
    "categories": [],
    "contents": "\nOkay, let’s start with the basics.\nWhy on Earth are you using Mathematica?\nI’m usually a MATLAB person, primarily because that’s what is used at our college. I got very comfortable with MATLAB and until a couple of months ago, I didn’t have a preference.\nHowever, when I started focusing on the mathematical , MATLAB became a huge pain in my ass. Yes, MATLAB has notebooks. Yes, MATLAB has markdown support. Yes, MATLAB is very efficient because it’s built on top of FORTRAN. Yes, MATLAB has a huge user base. But here’s where the problem begins. MATLAB did not start out this way. It didn’t really have notebooks and stuff. Over the years, MATLAB has gotten INCREDIBLY messy. I mean, the syntax is so clunky, it makes my blood boil.\nHere’s a question that crosses my mind: who is MATLAB perfect for?\nWhat’s a use case where MATLAB wins, hands down? The answer was very simple in 2007. Anyone involved in data analytics or numerical computation would have used MATLAB. However, a lot has changed since 2007. All the cool kids are now using Python (pioneers are switching to Julia though) and the number of python libraries is absolutely gigantic. So, if I’m involved in data analytics, MATLAB is not the optimal choice anymore.\n\nPython came into the spotlight in 2007\nIf we take a look at the popularity of programming languages 1, python has witnessed immense growth (from ~4% in 2006 to ~30% in 2021). MATLAB on the other hand, has witnessed a decline (~3% in 2006 to ~2% in 2021). Now, here’s what people will say:\n\nGee, MATLAB may have witnessed a 1% decline but Wolfram didn’t even make the list. LOL.\n\nThat’s just plain stupid! Wolfram lies in a different category. MATLAB is marketed as: “Math. Graphics. Programming.” 2 MATLAB markets itself as:\n\nMATLAB is a programming and numeric computing platform used by millions of engineers and scientists to analyze data, develop algorithms, and create models.\n\n\nhttps://pypl.github.io/PYPL.html↩︎\nhttps://www.mathworks.com/products/matlab.html↩︎\n",
    "preview": {},
    "last_modified": "2021-03-21T15:29:16+05:30",
    "input_file": {}
  }
]
